// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

// let result = "";
// let n = 30;
// for (let i = 20.5; i <= n; i+=0.5) {
// 	result +=(i - 0.5)+(i < n ? " " : "")
// }
// console.log(result); 




// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.



// let n = 27;
// for (let i = 10; i <=100; i+=10) {
// 	console.log(n * i);
// }




// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.



// let n = 10;
// for (let i = 1; i <= 100; i++) {
// 	let squareOfNumber = i ** 2;
// 	(squareOfNumber < n) ? console.log(i): null;
// }



// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).



let num = 11;
let flag = 'Просте';

for (let i = 2; i <= num; i++) {
  if (num % i === 0 && num !== i && num !== 1) {
    flag = 'Не просте';
}}
console.log(flag);






// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).


// let num = 81;
// for (let i = 1; i <= num; i*=3) {
// 	if(num === i){
// 		console.log('Tak');
// 	}
	
// }